import { MiniFooter } from "@/app/components/Footer/Footer";
import MyButton from "@/app/components/MyButton";
import Link from "next/link";
import React from "react";
import Markdown from "react-markdown";

type Props = {};

export default function Blog({}: Props) {
  const blog = {
    id: 1,
    title: "الصداع",
    description: `
أنواع الصداع
هناك أنواع كثيرة للصداع، ولكننا سنذكر نبذة مختصرة عن أشهر وأهم الأنواع وهم:

صداع التوتر (بالإنجليزية: Tension Headache): هو أكثر أنواع الصداع شيوعاً، حيث يبدأ هذا النوع عادةً ببطء ويزداد تدريجياً في منتصف اليوم. يحدث ذلك عندما تسبب تقلصات العضلات في الرأس ألمًا على جانبي الرأس وفي بعض الأحيان الرقبة. عادةً ما يسبب صداع التوتر ألم خفيف إلى متوسط يُشار إليه أحياناً على أنه شعور بالإحساس بالضغط حول الرأس.
كان يشار إلى صداع التوتر في كثير من الأحيان باسم "صداع تقلص العضلات" أو "صداع الإجهاد". من الممكن أن يكون هذا الصداع متقطعاً أو مزمناً.

صداع التوتر المتقطع: يستمر لساعات قليلة يومياً، ولكنه يدوم لعدة أسابيع.
صداع التوتر المزمن: يستمر لمدة 15 يوماً أو أكثر لمدة لا تقل عن 3 شهور.
العوامل المسببة: الإجهاد، وإجهاد العين، والنظام الغذائي، وقلة النوم.

الشقيقة (الصداع النصفي) (بالإنجليزية: Migraine Headache): يحدث عادةً في جانب واحد من الرأس، ويكون الألم نابضاً وعادةً مصحوبًا بغثيان، وعدم وضوح في الرؤية، وتوتر خفيف، وقد تحدث العلامات التحذيرية التي تعرف بالأورة (بالإنجليزية: Aura) قبل ألم الصداع بفترة وجيزة أو تتزامن مع حدوثه.
يعد الصداع النصفي أقل شيوعًا من صداع التوتر، لكنه لا يزال يؤثر على عدد كبير من الناس. ويحدث عندما يؤثر نشاط الدماغ غير الطبيعي على الدورة الدموية والتركيب الكيميائي في المخ، مما يؤدي إلى ألم يصاب به المريض عادةً في جانب واحد فقط من الرأس. يمكن أن يسبب الصداع النصفي آلاماً شديدة تستمر لساعات أو أيام.

العوامل المسببة: الوراثة، والإجهاد، وإجهاد العين، والتغيرات الهرمونية، والنظام الغذائي، والعوامل البيئية مثل الارتفاع والرطوبة، وقلة النوم.

الصداع العنقودي (بالإنجليزية: Cluster Headache): أقل شيوعًا من صداع التوتر والصداع النصفي. يحدث هذا النوع غالباً في جانب واحد من الرأس، ويتركز حول إحدى العينين، ويكون الألم شديداً، ويستمر ما بين 15 دقيقة إلى 3 ساعات. من الممكن أن يحدث مرة واحدة يومياً، وأحياناً يصل إلى 8 مرات يوميا لمدة أسابيع.
الصداع العنقودي مزعج بشكل خاص لأنه يجعل الشخص المصاب به غالباً ما يستيقظ في منتصف الليل، مما يجعل من الصعب العودة إلى النوم حتى يهدأ الألم.

العوامل المسببة: النظام الغذائي، وصدمات الرأس، والوراثة. (1) (2) (3)

:اقرا المزيد من خلال موقع الطبي

    `,
  };
  return (
    <div className="flex flex-col min-h-screen">
      <div className="flex-grow">
        <div className="rounded-md shadow-md duration-300 transform  hover:shadow-xl my-2 bg-gray-100 dark:text-white dark:bg-gray-800 p-6">
          <div className="mb-10">
            <h3 className="text-3xl ">{blog.title}</h3>
            <p className="text-sm text-gray-500 dark:text-gray-400 mt-2 ">
              2022-01-01
            </p>
          </div>
          <Markdown className="text-xl">{blog.description}</Markdown>
          <div className="flex justify-center gap-3 mt-5">
            <Link href="/blogs">
              <MyButton>مشاركة</MyButton>
            </Link>
            <Link href="/blogs">
              <MyButton>اقرا المزيد</MyButton>
            </Link>
          </div>
        </div>
      </div>
      <MiniFooter />
    </div>
  );
}
